In [1]:
#python basics-Day 1
#print something
print("Hello Data Science")

Hello Data Science

In [6]:
#variables
name= "Jagnoor"
year=3
print(f"Hi,I'm {"Jagnoor"},and I am in my year{year}")

Hi,I'm Jagnoor,and I am in my year3

In [8]:
#data types
num=29
pi=3.14
text="Data Science"
is_student=True

print(type(num),type(pi),type(text),type(is_student))

<class 'int'> <class 'float'> <class 'str'> <class 'bool'>

In [9]:
#lists
fruits=["apple","banana","cherry"]
print(fruits)

['apple', 'banana', 'cherry']

In [10]:
fruits.append("mango")
print("After append:",fruits)

After append: ['apple', 'banana', 'cherry', 'mango']

In [11]:
#dictionaries
student={"name": "Jagnoor","program": "BSc Data Science", "year":3}
print(student)
print("Program:", student["program"])

{'name': 'Jagnoor', 'program': 'BSc Data Science', 'year': 3}
Program: BSc Data Science

In [12]:
#for loop
for fruit in fruits:
    print("I like", fruit)

I like apple
I like banana
I like cherry
I like mango

In [13]:
#functions
def greet(person):
    return f"Hello,{person}!"
print(greet("World"))

Hello,World!

In [16]:
import pandas as pd

url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
df = pd.read_csv(url)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S